Add architecture diagram to README - replace to mermaid chart (#131)
* Add architecture diagram to README - replace to mermaid chart

Added a mermaid diagram to illustrate the architecture of the application.

* Improve styling in README for better clarity

Updated styling for components in the README for better readability.

* Refactor architecture diagram in README.md
